#从网页输入框获取的数据都是str类型的

#数据类型转换
#int() , str() , float() 
#用法
""" int(变量) 将变量转换成int型 以此类推 """
n=input("请输入：")
print(n)
""" 一定注意缩进！！！！代码尽量打头开始写，并且尽量不要随便换行 """
print("-------------------")
#-------------------------------------------------------------------------------------------------------------------------
# 算数运算符
# + - * / //(整除) % **(幂运算)
n = 2**3 #二的三次幂
print(n) #结果为8
#input输出结果为str型

#复合运算符
""" c+=a ： c=c+a
*= \= 以此类推 """

#比较运算符
""" <= >= == != < > 
输出结果为 bool值 True 或 False
运算符前后必须都要有且只有一个空格 """

#逻辑运算符
""" 
and 与 一假具假
or 或  一真具真
not 非 
"""