#制作日历
#main
#----------------------------------------------------------------------------------------------------------------------
def line(width):
    """ 输出分割线 """
    print('-'*width)
#----------------------------------------------------------------------------------------------------------------------
def the_day(days):
    """ 输出日历的30/31天 """
    i=0
    while i<=days:
        i=i+1
        print(i)
#---------------------------------------------------------------------------------------------------------------------
#第一步：让用户输入年月日
#声明一个用于接收用户输入的年月日的函数：
    """ 矫正星期计算公式中的错误：
    将1月作为上年的13月,2月作为上年的14月才能的出一二月的正确结果。 """  
years = input("请输入年月日,并用空格分开：")
number = years.split()#利用.split函数将输入的一组数据切成三个变量
year = int(number[0])
month = int(number[1])
day = int(number[2])
if month == 1:
    year -= 1
    month = 13
elif month == 2:
    year -= 1
    month = 14 
#第二步：通过录入的年月计算这天星期几
#计算公式：
w = (day+2*month+3*(month+1)//5+year+year//4-year//100+year//400) % 7+1 
print(f'这天是星期{w}')
#计算本月有几天：
if month == 1  or month == 3 or month == 5 or month == 7 or month == 8 or month == 10 or month ==12:
    days = 31
else:
    days = 30
print(days)
#制定日历页面
#第一行 星期
print("一 二 三 四 五 六 日")
line(20)#分割线
the_day(days)



