""" 
死循环：
while True 
    循环体
 """
#-------------------------------------------------------------------------------------------------------------------------
""" 
while 循环执行条件:
    循环体
"""
#循环体是从0开始数的,且python中没有自增(i++)和自减(i--)
i=0
while i<10:
    print(i)
    i=i+1
print("------------------------------------------------------")    
#---------------------------------------------------------------------------------------------------------------------------
""" 
range函数:
用于生成一个数列
用法：
range(start,stop,step):
start:定义数列的a(1) 默认为0
stop:用于定义数列的a(n)
step:用于定义 q(数列的增量) 默认为1

range数列中 a(n)不包含stop这个数，即 while i<10
 """
#输出查看range数列
range(1,10,1)
for i in range(1,10,1):
    print(i)

#----------------------------------------------------------------------------------------------------------------------------
"""
 break
跳出整个循环体
continue
结束本次循环
 """
#------------------------------------------------------------------------------------------------------------------------------
""" for 条件：
    循环体
else
    执行体

else的执行条件：for循环自己循环完毕，而非遇到break而终止循环 
因为for  else 语句整个结构是一个整体，而break是跳出循环体，所以else也被跳过了
"""